exports.handler = async (event, context) => {
  const medications = [
  {
    "name": "أجركس  75 مجم أقراص",
    "code": "0"
  },
  {
    "name": "أدوتراستوزوماب إمتانزين ١٠٠ مجم",
    "code": "0.0"
  },
  {
    "name": "أدوتراستوزوماب إمتانزين ١٦٠ مجم",
    "code": "0.0"
  },
  {
    "name": "أدويتين 20 مجم أقراص",
    "code": "0"
  },
  {
    "name": "أدويتين 30 مجم أقراص",
    "code": "0"
  },
  {
    "name": "أدويتين 60 مجم أقراص",
    "code": "0"
  },
  {
    "name": "إرينوتيكان ١٠٠ مجم/٥ مل",
    "code": "6223003840969.0"
  },
  {
    "name": "أزاسيتيدين ١٠٠ مجم",
    "code": "0.0"
  },
  {
    "name": "أسباراجينيز ١٠٠٠٠ وحدة دولية",
    "code": "0.0"
  },
  {
    "name": "أفيل ٤٥.٥ مجم/٢ مل  أمبولة",
    "code": "0.0"
  },
  {
    "name": "أوجمنتين 1 جم أقراص",
    "code": "0"
  },
  {
    "name": "أوكتوكونافال 300 مجم أقراص",
    "code": "0"
  },
  {
    "name": "أوكساليبلاتين ٢٠٠ مجم",
    "code": "0.0"
  },
  {
    "name": "أوكساليبلاتين ٥٠ مجم/١٠ مل",
    "code": "9003533001422.0"
  },
  {
    "name": "إيتوبوسيد ١٠٠ مجم",
    "code": "6223003840235.0"
  },
  {
    "name": "إيفوسفامايد ١ جم",
    "code": "6251605000047.0"
  },
  {
    "name": "إيفوسفامايد ٢ جم",
    "code": "6251605000030.0"
  },
  {
    "name": "ابيديكسون 5 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "ابيكوبريد /بريدينزولون-ادكو- 20 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ابيكوبريد /بريدينزولون-ادكو- 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ابيكوبنتن 600 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ابيكوبنتين 300 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ابيلات ريتارد 20 مجم أقراص",
    "code": "0"
  },
  {
    "name": "اتراكيورم 25 مجم أمبول",
    "code": "0"
  },
  {
    "name": "اتراكيورم 50 مجم أمبول",
    "code": "0"
  },
  {
    "name": "اتروبين 1 مجم أمبول",
    "code": "0"
  },
  {
    "name": "اتروفنت 250 مجم أمبول",
    "code": "0"
  },
  {
    "name": "اتروفنت 500 مجم أمبول",
    "code": "0"
  },
  {
    "name": "اتور 40 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ادافين 10 مللي أمبول",
    "code": "0"
  },
  {
    "name": "ادبورت 1 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ادرينالين 1 مجم أمبول",
    "code": "0"
  },
  {
    "name": "اراميديكس 1 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ارومازين 25 مجم أقراص",
    "code": "0"
  },
  {
    "name": "اسبرين 75 مجم",
    "code": "0"
  },
  {
    "name": "استوميجاز /داونيبرازول/تريتو الس 40 مجم أقراص",
    "code": "0"
  },
  {
    "name": "استيل سيستايين 200 مجم زجاجه",
    "code": "0"
  },
  {
    "name": "اسماكاست 5 مجم 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "اسيفيريكس 400 مجم أقراص",
    "code": "0"
  },
  {
    "name": "اسيكلوفير 0.05 مجم دهان موضعي",
    "code": "0"
  },
  {
    "name": "اسيكلوفير 200 مجم شراب",
    "code": "0"
  },
  {
    "name": "اسيكلوفير ٤٠٠ مجم أقراص",
    "code": "0"
  },
  {
    "name": "افيدرين 25 مجم أمبول",
    "code": "0"
  },
  {
    "name": "افيروزوليد 600 مجم أقراص",
    "code": "0"
  },
  {
    "name": "افيل 10 مجم أمبول",
    "code": "0"
  },
  {
    "name": "اكستروما 25 جم دهن موضعي",
    "code": "0"
  },
  {
    "name": "اكسوسارليك 250 مجم أقراص",
    "code": "0"
  },
  {
    "name": "اكسوسارليك 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "الجازل 40 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "الجيزال 40جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "الداكتون 100مجم أقراص",
    "code": "0"
  },
  {
    "name": "الداكتون 25مجم أقراص",
    "code": "0"
  },
  {
    "name": "الدوميت 250مجم أقراص",
    "code": "0"
  },
  {
    "name": "الكابرايد /جاناموتيل/ايتوماش 50 مجم أقراص",
    "code": "0"
  },
  {
    "name": "الكابرس 10 مجم أقراص",
    "code": "0"
  },
  {
    "name": "الكابرس 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "اليكويس 2.5مجم أقراص",
    "code": "0"
  },
  {
    "name": "اليكويس 5مجم أقراص",
    "code": "0"
  },
  {
    "name": "امبروكسول 120 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "امينوفيلين 25 مجم/مللي أمبول",
    "code": "0"
  },
  {
    "name": "امينوليبان 450 جم عبوه",
    "code": "0"
  },
  {
    "name": "امينوليبان 8 جم/100مل زجاجه",
    "code": "0"
  },
  {
    "name": "اميونميد -حكمه- 25 مجم أقراص",
    "code": "0"
  },
  {
    "name": "اميونميد -حكمه- 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "اناسترازول -ساندوز- 1 مجم أقراص",
    "code": "0"
  },
  {
    "name": "اناسترازول -سينثون- 1 مجم أقراص",
    "code": "0"
  },
  {
    "name": "انتوبرال 20محم أقراص",
    "code": "0"
  },
  {
    "name": "انتوبرال 40مجم أقراص",
    "code": "0"
  },
  {
    "name": "انتودين 20 مجم أمبول",
    "code": "0"
  },
  {
    "name": "انتي كوكس 15 مجم أقراص",
    "code": "0"
  },
  {
    "name": "انتي كوكس 75 مجم أمبول",
    "code": "0"
  },
  {
    "name": "اندروفيبان/ريفافلوفا 10 مجم أقراص",
    "code": "0"
  },
  {
    "name": "انشور 400 جم عبوه",
    "code": "0"
  },
  {
    "name": "اوبلكس 120مللي زجاجه",
    "code": "0"
  },
  {
    "name": "اورثوجلوب 500/400مجم أقراص",
    "code": "0"
  },
  {
    "name": "اورسوبلس 250/140 مجم أقراص",
    "code": "0"
  },
  {
    "name": "اولابكس 5مجم أقراص",
    "code": "0"
  },
  {
    "name": "اولفن 40 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "اوندالينز 8 مجم فيلم للذوبان بالفم",
    "code": "0"
  },
  {
    "name": "اونداميتك 4 مجم أمبول",
    "code": "0"
  },
  {
    "name": "اونداميتك 8 مجم أمبول",
    "code": "0"
  },
  {
    "name": "ايبانيوتين 50 مجم أمبول",
    "code": "0"
  },
  {
    "name": "ايبرانس 100 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ايبرانس 125 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ايبرانس 75 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ايتاسيل صني /ايتاميثيلات -ايناد فارما- 250 مجم أمبول",
    "code": "0"
  },
  {
    "name": "ايثاميثيلات 500 مجم أمبول",
    "code": "0"
  },
  {
    "name": "ايراستابكس 20/5/12.5مجم أقراص",
    "code": "0"
  },
  {
    "name": "ايزماتك 40 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ايزوبتن ريتارد 240 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ايزوفلوران 100 مل سم",
    "code": "0"
  },
  {
    "name": "ايزوميبروتون 40 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ايفراليكير 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ايمند 125 مجم+80 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ايموكس 250 مجم/5 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "ايموكس 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ايموكسيكلاف 1 جم أقراص",
    "code": "0"
  },
  {
    "name": "ايميكس /جرانتريل 1 مجم أمبول",
    "code": "0"
  },
  {
    "name": "ايميكس 1 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ايناديلفوكس 500 مجم أمبول",
    "code": "0"
  },
  {
    "name": "اينيماكس 120 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "باراسيتامول 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "باكليتاكسيل ١٠٠ مجم",
    "code": "6223003840105.0"
  },
  {
    "name": "باكليتاكسيل ٣٠٠ مجم",
    "code": "9003533001194.0"
  },
  {
    "name": "بالبوكيم 100 مجم أقراص",
    "code": "0"
  },
  {
    "name": "بالبوكيم 125 مجم أقراص",
    "code": "0"
  },
  {
    "name": "بالبوكيم 75 مجم أقراص",
    "code": "0"
  },
  {
    "name": "بالميكورت 0.5مجم أمبول",
    "code": "0"
  },
  {
    "name": "بانثينول 20 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "برمبران 10 مجم أمبول",
    "code": "0"
  },
  {
    "name": "بروجراف 1 مجم أقراص",
    "code": "0"
  },
  {
    "name": "بروفين 600 مجم أكياس",
    "code": "0"
  },
  {
    "name": "بروكاسوفت 2 مجم أقراص",
    "code": "0"
  },
  {
    "name": "برونشيكم 100 مللي شراب",
    "code": "0"
  },
  {
    "name": "بلميكورت 0.25مجم أمبول",
    "code": "0"
  },
  {
    "name": "بليندرا 400 جم عبوه",
    "code": "0"
  },
  {
    "name": "بليوميسين ١٥ وحدة دولية",
    "code": "0.0"
  },
  {
    "name": "بوتاسيوم كلوريد 0.03 أمبول",
    "code": "0"
  },
  {
    "name": "بوتاسيوم كلوريد شراب",
    "code": "0"
  },
  {
    "name": "بورتيزوميب ٣.٥ مجم",
    "code": "0.0"
  },
  {
    "name": "بون كير 0.25 مجم أقراص",
    "code": "0"
  },
  {
    "name": "بون وان 0.25 مجم أقراص",
    "code": "0"
  },
  {
    "name": "بي بي سي 60 مللي اسبراي",
    "code": "0"
  },
  {
    "name": "بي كوم 1000 ميكروجرام أمبول",
    "code": "0"
  },
  {
    "name": "بيبتامين 400 جم عبوه",
    "code": "0"
  },
  {
    "name": "بيبي كريم 50 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "بيتادين 100 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "بيتادين 120 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "بيتافوس 10مجم أمبول",
    "code": "0"
  },
  {
    "name": "بيدياشور 400 جم عبوه",
    "code": "0"
  },
  {
    "name": "بيرتوزوماب ١٢٠٠ مجم + تراستوزوماب ٦٠٠ مجم",
    "code": "7613326043281.0"
  },
  {
    "name": "بيرتوزوماب ٦٠٠ مجم + تراستوزوماب ٦٠٠ مجم",
    "code": "7613326043274.0"
  },
  {
    "name": "بيفاتراسين 150 جم عبوه",
    "code": "0"
  },
  {
    "name": "بيفاسيزوماب ٤٠٠ مجم/١٦ مل",
    "code": "0.0"
  },
  {
    "name": "بيكساسبير 2.5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "بيكساسبير 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "بيكساكولت 2.5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "بيكساكولت 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "بيمبروليزوماب ١٠٠ مجم",
    "code": "0.0"
  },
  {
    "name": "بيميتريكسيد ٥٠٠ مجم",
    "code": "6224001616136.0"
  },
  {
    "name": "بينداموستين ١٠٠ مجم",
    "code": "0.0"
  },
  {
    "name": "بينداموستين ٢٥ مجم",
    "code": "6221000010583.0"
  },
  {
    "name": "بيوجينيرز 510 جم عبوه",
    "code": "0"
  },
  {
    "name": "بيورنثول-حكمه- 50 مجم أقراص",
    "code": "0"
  },
  {
    "name": "بيونال 250/140مجم أقراص",
    "code": "0"
  },
  {
    "name": "تاجريسو 80 مجم أقراص",
    "code": "0"
  },
  {
    "name": "تاسيجنا 200 مجم أقراص",
    "code": "0"
  },
  {
    "name": "تافانيك 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "تاموفين -تكنو فارم- 10 مجم أقراص",
    "code": "0"
  },
  {
    "name": "تانتم 125 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "تايكرب 250 مجم أقراص",
    "code": "0"
  },
  {
    "name": "تراستوزوماب ٤٤٠ مجم (وريدي)",
    "code": "6221042592016.0"
  },
  {
    "name": "تراستوزوماب ٦٠٠ مجم (تحت الجلد)",
    "code": "7613326003957.0"
  },
  {
    "name": "ترامال 100 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ترامال 100 مجم أمبول",
    "code": "0"
  },
  {
    "name": "ترامال 50 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ترانكس 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ترانكسميك اسيد 500 مجم أمبول",
    "code": "0"
  },
  {
    "name": "ترستنال 120مللي زجاجه",
    "code": "0"
  },
  {
    "name": "تريبتيزول 25 مجم أقراص",
    "code": "0"
  },
  {
    "name": "تريكسزولا 2.5مجم أقراص",
    "code": "0"
  },
  {
    "name": "تلفاست 120مجم أقراص",
    "code": "0"
  },
  {
    "name": "تلفاست 180مجم أقراص",
    "code": "0"
  },
  {
    "name": "توبوتيكان ٤ مل",
    "code": "8902413019797.0"
  },
  {
    "name": "توسيليزوماب ٨٠ مجم/٤ مل",
    "code": "7613326015837.0"
  },
  {
    "name": "تيمودال 100 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ثرومبكس 40 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "جابتن 300 مجم أقراص",
    "code": "0"
  },
  {
    "name": "جابتين 600 مجم أقراص",
    "code": "0"
  },
  {
    "name": "جاستروبيوتك 550 مجم أقراص",
    "code": "0"
  },
  {
    "name": "جالفس مت - فيلداجلوز بلس 50/1000مجم أقراص",
    "code": "0"
  },
  {
    "name": "جاناتون 50 مجم أقراص",
    "code": "0"
  },
  {
    "name": "جراليبنتين 300 مجم أقراص",
    "code": "0"
  },
  {
    "name": "جراليبنتين 600 مجم أقراص",
    "code": "0"
  },
  {
    "name": "جرانتريل 2 مجم أقراص",
    "code": "0"
  },
  {
    "name": "جرانيسيترون ١ مجم/١ مل  أمبولة",
    "code": "6224000870096.0"
  },
  {
    "name": "جروث فورميولا 330 جم عبوه",
    "code": "0"
  },
  {
    "name": "جلوكوز / ملح -المتحدون- 500 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "جلوكوز / ملح -اوتسوكا- 500 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "جلوكوز -المتحدون- 500 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "جلوكوز -اوتسوكا- 100 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "جلوكوز -اوتسوكا- 25% -500مللي- زجاجه",
    "code": "0"
  },
  {
    "name": "جلوكوز -اوتسوكا- 250 ملي زجاجه",
    "code": "0"
  },
  {
    "name": "جلوكوز -اوتسوكا- 500 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "جلوكوز -اوتسوكا- 500مللي-10%- زجاجه",
    "code": "0"
  },
  {
    "name": "جلوكوز -اوتسوكا- 50مللي زجاجه",
    "code": "0"
  },
  {
    "name": "جليكوفوس 20 مللي أمبول",
    "code": "0"
  },
  {
    "name": "جوسيريلين ١٠.٨ مجم",
    "code": "0.0"
  },
  {
    "name": "جولدن لاكس 120 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "جيفيتينيب -هيكسال- 250 مجم أقراص",
    "code": "0"
  },
  {
    "name": "جيمسيتابين ١٠٠٠ مجم",
    "code": "6223003840938.0"
  },
  {
    "name": "جينلوكيم 300 ميكروجرام فيال",
    "code": "0"
  },
  {
    "name": "جينوفيل 500/400مجم أقراص",
    "code": "0"
  },
  {
    "name": "حمض الزوليدرونيك ٤ مجم/٥ مل",
    "code": "6223004900037.0"
  },
  {
    "name": "داراتوموماب ١٨٠٠ مجم/١٥ مل",
    "code": "0.0"
  },
  {
    "name": "داساتينيب -ساندوز- 50 مجم أقراص",
    "code": "0"
  },
  {
    "name": "داساتينيب -سينثون- 50 مجم أقراص",
    "code": "0"
  },
  {
    "name": "داسيورد -حكمه- 50 مجم أقراص",
    "code": "0"
  },
  {
    "name": "دافلون 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "داكاربازين ٢٠٠ مجم",
    "code": "0.0"
  },
  {
    "name": "دانست4 مجم أمبول",
    "code": "0"
  },
  {
    "name": "دانست8 مجم أمبول",
    "code": "0"
  },
  {
    "name": "دبرفان 1 جم/100مل أمبول",
    "code": "0"
  },
  {
    "name": "دوبيوتامين 250 مجم أمبول",
    "code": "0"
  },
  {
    "name": "دوروفين 500/400مجم كبسول",
    "code": "0"
  },
  {
    "name": "دوسيتاكسيل ٨٠ مجم",
    "code": "9003533001323.0"
  },
  {
    "name": "دوفالاك 100 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "دوكسوروبيسين ١٠ مجم",
    "code": "6223003840037.0"
  },
  {
    "name": "دوكسوروبيسين ٥٠ مجم/٢٥ مل",
    "code": "0.0"
  },
  {
    "name": "دولفين-ك 75مجم أمبول",
    "code": "0"
  },
  {
    "name": "دولكسبرين 20 مجم أقراص",
    "code": "0"
  },
  {
    "name": "دولكسبرين 30 مجم أقراص",
    "code": "0"
  },
  {
    "name": "دولكسبرين 60 مجم أقراص",
    "code": "0"
  },
  {
    "name": "دوليبران 1 جم أقراص",
    "code": "0"
  },
  {
    "name": "ديبوفيت ب12 1000 ميكروجرام أمبول",
    "code": "0"
  },
  {
    "name": "ديسفلاتيل 40مجم أقراص",
    "code": "0"
  },
  {
    "name": "ديفيتون 2000 وحده زجاجه",
    "code": "0"
  },
  {
    "name": "ديكسافين 100 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "ديكساميثازون ١٠ مجم/٢ مل  أمبولة",
    "code": "0.0"
  },
  {
    "name": "ديكساميثازون ٨ مجم/٢ مل  أمبولة",
    "code": "0.0"
  },
  {
    "name": "ديكساميثازون -العامريه- 8 مجم أمبول",
    "code": "0"
  },
  {
    "name": "ديكلاك 75مجم أمبول",
    "code": "0"
  },
  {
    "name": "دينوسوماب ١٢٠ مجم",
    "code": "0.0"
  },
  {
    "name": "ديورسيف 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "رابيبركريل 20 مجم أقراص",
    "code": "0"
  },
  {
    "name": "راجيتوفاك 4 مجم أمبول",
    "code": "0"
  },
  {
    "name": "راجيتوفاك 8 مجم أمبول",
    "code": "0"
  },
  {
    "name": "راسيكاريا 100 مجم أقراص",
    "code": "0"
  },
  {
    "name": "رنجر اسيتات -اوتسوكا- 500 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "رنجر -المتحدون- 500 مل زجاجه",
    "code": "0"
  },
  {
    "name": "رنجر -اوتسوكا- 500 مل زجاجه",
    "code": "0"
  },
  {
    "name": "روتادانسيترون 4 مجم أمبول",
    "code": "0"
  },
  {
    "name": "روتادانسيترون 8 مجم أمبول",
    "code": "0"
  },
  {
    "name": "ريباريل 40 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "ريتوكسيماب ١٠٠ مجم",
    "code": "0.0"
  },
  {
    "name": "ريتوكسيماب ٥٠٠ مجم",
    "code": "0.0"
  },
  {
    "name": "زاديما 40 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "زارزيو 300 ميكروجرم سرنجات",
    "code": "0"
  },
  {
    "name": "زاميبرجال 4 مجم فيال",
    "code": "0"
  },
  {
    "name": "زانسيستوب /زانسيستوب/ستاتيوريك/فبيوريك 80 مجم أقراص",
    "code": "0"
  },
  {
    "name": "زوفاترون 4 مجم أمبول",
    "code": "0"
  },
  {
    "name": "زوفاترون 8 مجم أمبول",
    "code": "0"
  },
  {
    "name": "زوفاترون 8 مجم فيلم للذوبان بالفم",
    "code": "0"
  },
  {
    "name": "زوفيراكس 400 مجم أقراص",
    "code": "0"
  },
  {
    "name": "زيتيجا 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "زيثروماكس 250مجم أقراص",
    "code": "0"
  },
  {
    "name": "زيثروماكس 500مجم أقراص",
    "code": "0"
  },
  {
    "name": "زيرتك 10 مجم أقراص",
    "code": "0"
  },
  {
    "name": "زيرتك 120 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "زيلون فورت 100 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "سالفاكس 60 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "ساندميون نيورال 100 مجم زجاجه",
    "code": "0"
  },
  {
    "name": "سايكلوفوسفامايد ١ جم",
    "code": "0.0"
  },
  {
    "name": "سبازموتالين 135 مجم أقراص",
    "code": "0"
  },
  {
    "name": "سبازموفري 5مجم أمبول",
    "code": "0"
  },
  {
    "name": "سبرايسل 50 مجم أقراص",
    "code": "0"
  },
  {
    "name": "سبورتان 30مللي زجاجه",
    "code": "0"
  },
  {
    "name": "ستاركوبركس 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ستريم 480 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ستوبريا 2 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ستيرونات 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "سكيناترا 15 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "سمباتكس 20 مجم أقراص",
    "code": "0"
  },
  {
    "name": "سمباتكس 30 محم أقراص",
    "code": "0"
  },
  {
    "name": "سمباتكس 60 مجم أقراص",
    "code": "0"
  },
  {
    "name": "سوكساميثينيوم-سكسينيل كولين- 50 مجم /مللي أمبول",
    "code": "0"
  },
  {
    "name": "سيبتازل 120 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "سيبتازل 480 مجم أقراص",
    "code": "0"
  },
  {
    "name": "سيبروفلوكساسين 500مجم أقراص",
    "code": "0"
  },
  {
    "name": "سيتارابين ١ جم",
    "code": "0.0"
  },
  {
    "name": "سيديبروكت 20 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "سيردالود 4مجم أقراص",
    "code": "0"
  },
  {
    "name": "سيروكويل 25مجم أقراص",
    "code": "0"
  },
  {
    "name": "سيريبرولايسن 5 مللي أمبول",
    "code": "0"
  },
  {
    "name": "سيسبلاتين ١٠ مجم",
    "code": "0.0"
  },
  {
    "name": "سيسبلاتين ٥٠ مجم",
    "code": "0.0"
  },
  {
    "name": "سيفوفلوران باكستر 100 مجم/100 مللي سم",
    "code": "0"
  },
  {
    "name": "سيفوفلوران صاني 100 مجم/100 مللي سم",
    "code": "0"
  },
  {
    "name": "سيلسيبت 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "سيليكوكس /يوروكوكس 200 مجم أقراص",
    "code": "0"
  },
  {
    "name": "صوديوم بيكربونات -اوتسوكا- 0.084 أمبول",
    "code": "0"
  },
  {
    "name": "فاركولين 0.005 محلول",
    "code": "0"
  },
  {
    "name": "فاركولين 100 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "فازلودكس 250 مجم سرنجات",
    "code": "0"
  },
  {
    "name": "فاموتين/فاموتاك 40 مجم أقراص",
    "code": "0"
  },
  {
    "name": "فرزينيو 150 مجم أقراص",
    "code": "0"
  },
  {
    "name": "فريسوبين بودر 300 جم عبوه",
    "code": "0"
  },
  {
    "name": "فلاجيل 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "فلودارابين ٥٠ مجم",
    "code": "0.0"
  },
  {
    "name": "فلورويوراسيل ٥٠٠ مجم  أمبولة",
    "code": "0.0"
  },
  {
    "name": "فلوكونازول -فارو فارما-/يوني فنجي -يونيفارما- 150 مجم أقراص",
    "code": "0"
  },
  {
    "name": "فنتادور 100 مجم أمبول",
    "code": "0"
  },
  {
    "name": "فنتادور 25 ميكروجرام باتش",
    "code": "0"
  },
  {
    "name": "فنتادور 75 ميكروجرام باتش",
    "code": "0"
  },
  {
    "name": "فنتوكلاكس 100مجم أقراص",
    "code": "0"
  },
  {
    "name": "فوترينت 400 مجم أقراص",
    "code": "0"
  },
  {
    "name": "فورتيكير 30 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "فورسيجا 10 مجم أقراص",
    "code": "0"
  },
  {
    "name": "فولفسترانت 250 مجم سرنجات",
    "code": "0"
  },
  {
    "name": "فولفن 500 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "فولفيسترانت ٢٥٠ مجم",
    "code": "9088884957581.0"
  },
  {
    "name": "فوليك اسيد 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "فوليكاب 0.5مجم أقراص",
    "code": "0"
  },
  {
    "name": "فيتايامي 1000 مجم أقراص",
    "code": "0"
  },
  {
    "name": "فيرسابنيا 50 مجم أقراص",
    "code": "0"
  },
  {
    "name": "فيروستات 400 مجم أقراص",
    "code": "0"
  },
  {
    "name": "فيسانويد 10 مجم أقراص",
    "code": "0"
  },
  {
    "name": "فيسرالجين 5مجم أمبول",
    "code": "0"
  },
  {
    "name": "فيفند 200 مجم أقراص",
    "code": "0"
  },
  {
    "name": "فيكتيبكس ٤٠٠ مجم/٢٠ مل",
    "code": "0.0"
  },
  {
    "name": "فيلجراستيم ٣٠ مليون وحدة دولية",
    "code": "0.0"
  },
  {
    "name": "فيلجراستيم ٣٠٠ ميكروجرام",
    "code": "6221042569018.0"
  },
  {
    "name": "فيلجراستيم سيديكو 300 ميكروجرام فيال",
    "code": "0"
  },
  {
    "name": "فيمابنت 2.5مجم أقراص",
    "code": "0"
  },
  {
    "name": "فينكريستين ١ مجم",
    "code": "6223003840075.0"
  },
  {
    "name": "فيوتاتريت 750مجم أقراص",
    "code": "0"
  },
  {
    "name": "فيوسيدين 20 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "قيوسيديك اسيد -ايجيفار- 20 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "كابتوبريل -ايه جي بي اي- 25 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كابسيتابين -اكورد- 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كابيسيتابين أكورد /فياتريس/ايفر فارما 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كابيسيتاجيت 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كاربالتا 20 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كاربالتا 30 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كاربالتا 60 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كاربوبلاتين ١٥٠ مجم/١٥ مل",
    "code": "0.0"
  },
  {
    "name": "كاربوبلاتين ٤٥٠ مجم/٤٥ مل",
    "code": "0.0"
  },
  {
    "name": "كارديكسين 0.5مجم أمبول",
    "code": "0"
  },
  {
    "name": "كارديورا 4مجم أقراص",
    "code": "0"
  },
  {
    "name": "كارسيميا 400 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كارفبد 6.25مجم أقراص",
    "code": "0"
  },
  {
    "name": "كارفيد 25 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كارنيتول 1 جم أمبول",
    "code": "0"
  },
  {
    "name": "كارنيتول 500مجم أقراص",
    "code": "0"
  },
  {
    "name": "كازودكس 50 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كالبرج 1600 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كالسيوم -اوتسوكا- 1 جم أمبول",
    "code": "0"
  },
  {
    "name": "كالسيوم جلوكونات صني /كاسيونات -ممفيس- 1 جم أمبول",
    "code": "0"
  },
  {
    "name": "كالكوينس 100 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كسكالي 200 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كلافيموكس 1 جم أقراص",
    "code": "0"
  },
  {
    "name": "كلكسان 40 وحده سرنجات",
    "code": "0"
  },
  {
    "name": "كلكسان 60 وحده سرنجات",
    "code": "0"
  },
  {
    "name": "كلكسان 80 وحده سرنجات",
    "code": "0"
  },
  {
    "name": "كلورال 10/100مجم زجاجه",
    "code": "0"
  },
  {
    "name": "كلورفينرامين -سيديكو- 10 مجم أمبول",
    "code": "0"
  },
  {
    "name": "كوباد 10000وحده أقراص",
    "code": "0"
  },
  {
    "name": "كونازوجلوب 200 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كوناكيون 10 مجم أمبول",
    "code": "0"
  },
  {
    "name": "كونستوفا 2 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كونفنتن 300 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كونفنتن 600 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كونكور 2.5مجم أقراص",
    "code": "0"
  },
  {
    "name": "كونكور 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "كيتامين 50 مجم سم",
    "code": "0"
  },
  {
    "name": "كيتريل 1 مجم أمبول",
    "code": "0"
  },
  {
    "name": "كيتولاك /ادلور 30 مجم أمبول",
    "code": "0"
  },
  {
    "name": "كيدمين -اوتسوكا- 250 مل زجاجه",
    "code": "0"
  },
  {
    "name": "كيدمين -اوتسوكا- 500 مل زجاجه",
    "code": "0"
  },
  {
    "name": "كيميثيراز 100 مجم أقراص",
    "code": "0"
  },
  {
    "name": "لازكس 20 مجم أمبول",
    "code": "0"
  },
  {
    "name": "لازكس 40 مجم أمبول",
    "code": "0"
  },
  {
    "name": "لاسيفار 20 مجم أمبول",
    "code": "0"
  },
  {
    "name": "لوتريتيم 2.5مجم أقراص",
    "code": "0"
  },
  {
    "name": "لوفير 400 مجم أقراص",
    "code": "0"
  },
  {
    "name": "لولاويست 4مجم أكياس",
    "code": "0"
  },
  {
    "name": "ليباكتوفو 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ليتريزول -اف بي اي- 2.5مجم أقراص",
    "code": "0"
  },
  {
    "name": "ليجنوكايين 20 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "ليفاجول 450 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ليفنوسيز/سيزرليس 1000 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ليفوفرين / نور ابينيفرين -صني-/نور ابينيفرين -مايرولا- 1 مجم/ مللي أمبول",
    "code": "0"
  },
  {
    "name": "ليفونسيز/سيزرليس 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ليفوهستام 120 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "ليفوهستام 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ليفيبيكس 100 مجم/مللي زجاجه",
    "code": "0"
  },
  {
    "name": "ليناليدوميد -ايفا- 25 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ليناليدوميد -ايفا- 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "لينبارزا 150 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ماء أكسجين 10%-20%-30% 10-20-30/100مللي زجاجه",
    "code": "0"
  },
  {
    "name": "ماء مقطر 1 لتر 1 لتر زجاجه",
    "code": "0"
  },
  {
    "name": "ماغنسيوم -اوتسوكا- 100 مجم/مللي أمبول",
    "code": "0"
  },
  {
    "name": "مانيتول -افيروس- 0.2 زجاجه",
    "code": "0"
  },
  {
    "name": "مانيتول -اوتسوكا- 0.1 زجاجه",
    "code": "0"
  },
  {
    "name": "مايستروتنس 1 مجم أمبول",
    "code": "0"
  },
  {
    "name": "مثيل تكنو 1000 مكجم فيلم للذوبان بالفم",
    "code": "0"
  },
  {
    "name": "محلول ملح -المتحدون- 250 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "محلول ملح -المتحدون- 500 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "محلول ملح -اوتسوكا- 100مللي زجاجه",
    "code": "0"
  },
  {
    "name": "محلول ملح -اوتسوكا- 250 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "محلول ملح -اوتسوكا- 50 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "محلول ملح -اوتسوكا- 500 مللي زجاجه",
    "code": "0"
  },
  {
    "name": "محلول ملح -اوتسوكا- 500مللي-(3%)- زجاجه",
    "code": "0"
  },
  {
    "name": "منيرين ميلت 120 ميكرجرام أقراص",
    "code": "0"
  },
  {
    "name": "موبيراكس 0.02 دهان موضعي",
    "code": "0"
  },
  {
    "name": "موتيليم 10مجم أقراص",
    "code": "0"
  },
  {
    "name": "ميباسيل 140 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ميتروجين 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ميتوكسانترون ٢٠ مجم",
    "code": "6223003840204.0"
  },
  {
    "name": "ميثابيوجين 8 مجم أقراص",
    "code": "0"
  },
  {
    "name": "ميثوتريكسات ٥٠ مجم/٢ مل",
    "code": "6223003840136.0"
  },
  {
    "name": "ميثوتريكسات ٥٠٠ مجم/٢ مل",
    "code": "6223003840143.0"
  },
  {
    "name": "ميجاموكس1 جم أقراص",
    "code": "0"
  },
  {
    "name": "ميديكسافلام 15مجم أمبول",
    "code": "0"
  },
  {
    "name": "ميراج 1 جم فيال",
    "code": "0"
  },
  {
    "name": "ميركابتوبيورين 50 مجم -سينثون- أقراص",
    "code": "0"
  },
  {
    "name": "ميسنا ٤٠٠ مجم  أمبولة",
    "code": "6223003840259.0"
  },
  {
    "name": "ميلجا 250 ميكروجرام أقراص",
    "code": "0"
  },
  {
    "name": "ميلفالان ٥٠ مجم",
    "code": "8904187891821.0"
  },
  {
    "name": "ميلفلان 50 مجم فيال",
    "code": "0"
  },
  {
    "name": "ناتيران 25 مجم أقراص",
    "code": "0"
  },
  {
    "name": "نافلبين 20 مجم أقراص",
    "code": "0"
  },
  {
    "name": "نافيسيترون 1 مجم أمبول",
    "code": "0"
  },
  {
    "name": "نالوفين -امون- 20 مجم أمبول",
    "code": "0"
  },
  {
    "name": "نايت كالم 3 مجم أقراص",
    "code": "0"
  },
  {
    "name": "نورفاسك 10 مجم أقراص",
    "code": "0"
  },
  {
    "name": "نورفاسك 5 مجم أقراص",
    "code": "0"
  },
  {
    "name": "نولفاديكس 10 مجم أقراص",
    "code": "0"
  },
  {
    "name": "نويوريك 100 مجم أقراص",
    "code": "0"
  },
  {
    "name": "نويوريك 300 مجم أقراص",
    "code": "0"
  },
  {
    "name": "نيبوجين 300 ميكروجرم سرنجات",
    "code": "0"
  },
  {
    "name": "نيتروديرم 5 مجم باتش",
    "code": "0"
  },
  {
    "name": "نيترونال صني 1 مجم/1 مللي فيال",
    "code": "0"
  },
  {
    "name": "نيرين 50 مجم فيال",
    "code": "0"
  },
  {
    "name": "نيستاتين 100 الف وحده نقط",
    "code": "0"
  },
  {
    "name": "نيفولوماب ١٠٠ مجم/١٠ مل",
    "code": "0.0"
  },
  {
    "name": "نيوروتون 250 ميكروجرام أقراص",
    "code": "0"
  },
  {
    "name": "نيوروفيت 250 ميكروجرام أقراص",
    "code": "0"
  },
  {
    "name": "نيورونتين 300 مجم أقراص",
    "code": "0"
  },
  {
    "name": "نيوميون 400 جم عبوه",
    "code": "0"
  },
  {
    "name": "هولوكسان 1 جم فيال",
    "code": "0"
  },
  {
    "name": "هولوكسان 2 جم فيال",
    "code": "0"
  },
  {
    "name": "هيباميرز 5 جم أمبول",
    "code": "0"
  },
  {
    "name": "هيدروكسي يوريا -ميداك- 500 مجم أقراص",
    "code": "0"
  },
  {
    "name": "هيدروكورتيزون ابيكو 100 مجم/2 مللي فيال",
    "code": "0"
  },
  {
    "name": "هيرسبتن 600 مجم فيال",
    "code": "0"
  },
  {
    "name": "هيليكيور 500/40/25مجم أقراص",
    "code": "0"
  },
  {
    "name": "هيموكلار 40 جم دهان موضعي",
    "code": "0"
  },
  {
    "name": "ونسيف 1 جم فيال",
    "code": "0"
  },
  {
    "name": "وونكيور 20 جم بودر",
    "code": "0"
  },
  {
    "name": "يونيتاكسيل ٣٠ مجم",
    "code": "0.0"
  },
  {
    "name": "يونيسيتين -حكمه- 50 مجم فيال",
    "code": "0"
  },
  {
    "name": "يونيليكسام 500 مجم أقراص",
    "code": "0"
  }
];

  
  return {
    statusCode: 200,
    body: JSON.stringify({ medications: medications })
  };
};